Revit 2027 API
MultiServerService.ExecutionPolicy Property
 Specifies how a multi-server service executes servers during its execution.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExecutionPolicy ExecutionPolicy { get; }
Public ReadOnly Property ExecutionPolicy As ExecutionPolicy
	Get
public:
property ExecutionPolicy ExecutionPolicy {
	ExecutionPolicy get ();
}
member ExecutionPolicy : ExecutionPolicy with get
Property Value
ExecutionPolicy
Remarks
 Read descriptions for the items in the ExecutionPolicy enum to find out details about all applicable execution policies.
See Also
Reference
MultiServerService Class
Autodesk.Revit.DB.ExternalService Namespace